
## Plan Result (prd)

[CI link](https://github.com/fumi-mura/tfaction-sample/actions/runs/17699574014)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.cwlogs1.aws_cloudwatch_log_group.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.cwlogs1.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "test-1"
      + name_prefix       = (known after apply)
      + region            = "ap-northeast-1"
      + retention_in_days = 30
      + skip_destroy      = false
      + tags_all          = {
          + "Env"                = "prd"
          + "ManagedByTerraform" = "true"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":16,"Program":"tfcmt","SHA1":"a426a93bf586f251b31a5fc83c5399fd0c75fec8","Target":"prd","Vars":{},"WorkflowName":"Terraform plan"} -->